# ------------------------------------------------------------------------------------------------------------------------- #
# проверка на одинаковые цифры в числе: ----------------------------------------------------------------------------------- #
# ------------------------------------------------------------------------------------------------------------------------- #
a = input('Введите любое число:\n') # запрос числа от пользователя
b = set() # объявление множества b
for i in range(0, len(a)): # цикл, добавляющий поочередно каждую цифру из "числа" полученного от пользователя в множество b
	b.add(a[i:i+1])
if len(a) == len(b): # сравнение кол-ва символов в изначальном числе и множестве b
    print('Одинаковые числа не найдены.')
else:
    print('Одинаковые числа найдены!')

# ------------------------------------------------------------------------------------------------------------------------- #
# 
# ------------------------------------------------------------------------------------------------------------------------- #
